app/controllers/students_controller.rb

  def create
    @student = Student.new
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-06-20 14:59:13.618218"], ["updated_at", "2018-06-20 14:59:13.618218"]]

  def update
    @student = Student.update(student_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-06-20 15:32:09.335580"], ["id", 1]]